ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader Size
menu.timer=Timer PWM Frequency
menu.float=Floating Point
menu.config=Build Options

# CatWAN Bast Pro Mini

electroniccats_Bast_Pro_Mini_M0.name=Electronic Cats Bast Pro Mini M0
electroniccats_Bast_Pro_Mini_M0.vid.0=0x1209
electroniccats_Bast_Pro_Mini_M0.pid.0=0xBAB3
electroniccats_Bast_Pro_Mini_M0.vid.1=0x1209
electroniccats_Bast_Pro_Mini_M0.pid.1=0xBAB3
electroniccats_Bast_Pro_Mini_M0.upload.tool=bossac
electroniccats_Bast_Pro_Mini_M0.upload.protocol=sam-ba
electroniccats_Bast_Pro_Mini_M0.upload.maximum_size=262144
electroniccats_Bast_Pro_Mini_M0.upload.offset=0x2000
electroniccats_Bast_Pro_Mini_M0.upload.use_1200bps_touch=true
electroniccats_Bast_Pro_Mini_M0.upload.wait_for_upload_port=true
electroniccats_Bast_Pro_Mini_M0.upload.native_usb=true
electroniccats_Bast_Pro_Mini_M0.build.mcu=cortex-m0plus
electroniccats_Bast_Pro_Mini_M0.build.mathlib=arm_cortexM0l_math
electroniccats_Bast_Pro_Mini_M0.build.f_cpu=48000000L
electroniccats_Bast_Pro_Mini_M0.build.usb_product="Bast Pro Mini M0"
electroniccats_Bast_Pro_Mini_M0.build.usb_manufacturer="Electronic Cats"
electroniccats_Bast_Pro_Mini_M0.build.board=bast_pro_mini_m0
electroniccats_Bast_Pro_Mini_M0.build.core=arduino
electroniccats_Bast_Pro_Mini_M0.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_Bast_Pro_Mini_M0.build.ldscript=flash_256KB.ld
electroniccats_Bast_Pro_Mini_M0.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_Bast_Pro_Mini_M0.build.variant=bast_pro_mini_m0
electroniccats_Bast_Pro_Mini_M0.build.variant_system_lib=
electroniccats_Bast_Pro_Mini_M0.build.vid=0x1209
electroniccats_Bast_Pro_Mini_M0.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.bootloader.tool=openocd
electroniccats_Bast_Pro_Mini_M0.bootloader.file=bast_pro_mini_m0/bootloader-bast-pro-mini-m0-v2.0.0.bin
electroniccats_Bast_Pro_Mini_M0.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_Bast_Pro_Mini_M0.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_Bast_Pro_Mini_M0.menu.float.print=Print uses separate singles and doubles
electroniccats_Bast_Pro_Mini_M0.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_Bast_Pro_Mini_M0.menu.float.string=String uses separate singles and doubles
electroniccats_Bast_Pro_Mini_M0.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_Bast_Pro_Mini_M0.menu.float.both=Print & String use separate singles and doubles
electroniccats_Bast_Pro_Mini_M0.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_Bast_Pro_Mini_M0.menu.config.disabled=config.h disabled
electroniccats_Bast_Pro_Mini_M0.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_Bast_Pro_Mini_M0.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_Bast_Pro_Mini_M0.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_Bast_Pro_Mini_M0.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_Bast_Pro_Mini_M0.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_Bast_Pro_Mini_M0.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_Bast_Pro_Mini_M0.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_Bast_Pro_Mini_M0.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_Bast_Pro_Mini_M0.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_Bast_Pro_Mini_M0.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_Bast_Pro_Mini_M0.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_Bast_Pro_Mini_M0.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.upload.tool=bossac
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_Bast_Pro_Mini_M0.menu.bootloader.8kb.upload.native_usb=true
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart.build.serialcom_uart=ONE_UART
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart.build.serialcom_spi=NO_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.two_uart.build.serialcom_uart=TWO_UART
electroniccats_Bast_Pro_Mini_M0.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
electroniccats_Bast_Pro_Mini_M0.menu.serial.two_uart.build.serialcom_spi=NO_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
electroniccats_Bast_Pro_Mini_M0.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
electroniccats_Bast_Pro_Mini_M0.menu.serial.no_uart.build.serialcom_uart=NO_UART
electroniccats_Bast_Pro_Mini_M0.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
electroniccats_Bast_Pro_Mini_M0.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc=CDC_ONLY
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc_hid=CDC_HID
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_Bast_Pro_Mini_M0.menu.usb.cdc_hid.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.menu.usb.withcdc=WITH_CDC
electroniccats_Bast_Pro_Mini_M0.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_Bast_Pro_Mini_M0.menu.usb.withcdc.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.menu.usb.hid=HID_ONLY
electroniccats_Bast_Pro_Mini_M0.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_Bast_Pro_Mini_M0.menu.usb.hid.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.menu.usb.nocdc=WITHOUT_CDC
electroniccats_Bast_Pro_Mini_M0.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_Bast_Pro_Mini_M0.menu.usb.nocdc.build.pid=0xBAB3
electroniccats_Bast_Pro_Mini_M0.menu.usb.none=USB_DISABLED
electroniccats_Bast_Pro_Mini_M0.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_Bast_Pro_Mini_M0.menu.usb.none.build.pid=0xBAB3

# CatWAN USB Stick

