ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
electroniccats_USB_Stick.name=Electronic Cats CatWAN USB Stick
electroniccats_USB_Stick.vid.0=0x1209
electroniccats_USB_Stick.pid.0=0xBAB2
electroniccats_USB_Stick.vid.1=0x1209
electroniccats_USB_Stick.pid.1=0xBAB2
electroniccats_USB_Stick.upload.tool=bossac
electroniccats_USB_Stick.upload.protocol=sam-ba
electroniccats_USB_Stick.upload.maximum_size=262144
electroniccats_USB_Stick.upload.offset=0x2000
electroniccats_USB_Stick.upload.use_1200bps_touch=true
electroniccats_USB_Stick.upload.wait_for_upload_port=true
electroniccats_USB_Stick.upload.native_usb=true
electroniccats_USB_Stick.build.mcu=cortex-m0plus
electroniccats_USB_Stick.build.mathlib=arm_cortexM0l_math
electroniccats_USB_Stick.build.f_cpu=48000000L
electroniccats_USB_Stick.build.usb_product="CatWAN USB_Stick"
electroniccats_USB_Stick.build.usb_manufacturer="Electronic Cats"
electroniccats_USB_Stick.build.board=catwan_usb_stick
electroniccats_USB_Stick.build.core=arduino
electroniccats_USB_Stick.build.extra_flags=-DCRYSTALLESS -DARDUINO_SAMD_ZERO -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
electroniccats_USB_Stick.build.ldscript=flash_256KB.ld
electroniccats_USB_Stick.build.openocdscript=openocd_scripts/arduino_zero.cfg
electroniccats_USB_Stick.build.variant=catwan_usb_stick
electroniccats_USB_Stick.build.variant_system_lib=
electroniccats_USB_Stick.build.vid=0x1209
electroniccats_USB_Stick.build.pid=0xBAB2
electroniccats_USB_Stick.bootloader.tool=openocd
electroniccats_USB_Stick.bootloader.file=catwan_usb_stick/bootloader-CatWAN-USB-Stick-v2.0.1.bin
electroniccats_USB_Stick.float.default=Print & String use auto-promoted doubles only
electroniccats_USB_Stick.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_USB_Stick.float.print=Print uses separate singles and doubles
electroniccats_USB_Stick.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_USB_Stick.float.string=String uses separate singles and doubles
electroniccats_USB_Stick.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_USB_Stick.float.both=Print & String use separate singles and doubles
electroniccats_USB_Stick.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_USB_Stick.config.disabled=config.h disabled
electroniccats_USB_Stick.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_USB_Stick.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_USB_Stick.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_USB_Stick.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_USB_Stick.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_USB_Stick.clock.internal=INTERNAL_OSCILLATOR
electroniccats_USB_Stick.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_USB_Stick.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_USB_Stick.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_USB_Stick.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_USB_Stick.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_USB_Stick.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_USB_Stick.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_USB_Stick.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_USB_Stick.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_USB_Stick.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_USB_Stick.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_USB_Stick.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_USB_Stick.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_USB_Stick.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_USB_Stick.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_USB_Stick.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_USB_Stick.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_USB_Stick.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_USB_Stick.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_USB_Stick.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_USB_Stick.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_USB_Stick.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_USB_Stick.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_USB_Stick.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_USB_Stick.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_USB_Stick.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_USB_Stick.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_USB_Stick.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_USB_Stick.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_USB_Stick.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_USB_Stick.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_USB_Stick.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_USB_Stick.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_USB_Stick.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_USB_Stick.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_USB_Stick.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_USB_Stick.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_USB_Stick.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_USB_Stick.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_USB_Stick.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_USB_Stick.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_USB_Stick.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_USB_Stick.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_USB_Stick.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_USB_Stick.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_USB_Stick.bootloader.8kb=8KB_BOOTLOADER
electroniccats_USB_Stick.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_USB_Stick.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_USB_Stick.bootloader.8kb.upload.tool=bossac
electroniccats_USB_Stick.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_USB_Stick.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_USB_Stick.bootloader.8kb.upload.native_usb=true
electroniccats_USB_Stick.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
electroniccats_USB_Stick.serial.one_uart.build.serialcom_uart=ONE_UART
electroniccats_USB_Stick.serial.one_uart.build.serialcom_wire=ONE_WIRE
electroniccats_USB_Stick.serial.one_uart.build.serialcom_spi=NO_SPI
electroniccats_USB_Stick.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
electroniccats_USB_Stick.serial.two_uart.build.serialcom_uart=TWO_UART
electroniccats_USB_Stick.serial.two_uart.build.serialcom_wire=NO_WIRE
electroniccats_USB_Stick.serial.two_uart.build.serialcom_spi=NO_SPI
electroniccats_USB_Stick.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
electroniccats_USB_Stick.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
electroniccats_USB_Stick.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
electroniccats_USB_Stick.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
electroniccats_USB_Stick.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
electroniccats_USB_Stick.serial.no_uart.build.serialcom_uart=NO_UART
electroniccats_USB_Stick.serial.no_uart.build.serialcom_wire=ONE_WIRE
electroniccats_USB_Stick.serial.no_uart.build.serialcom_spi=ONE_SPI
electroniccats_USB_Stick.usb.cdc=CDC_ONLY
electroniccats_USB_Stick.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_USB_Stick.usb.cdc.build.pid=0xBAB2
electroniccats_USB_Stick.usb.cdc_hid=CDC_HID
electroniccats_USB_Stick.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_USB_Stick.usb.cdc_hid.build.pid=0xBAB2
electroniccats_USB_Stick.usb.withcdc=WITH_CDC
electroniccats_USB_Stick.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_USB_Stick.usb.withcdc.build.pid=0xBAB2
electroniccats_USB_Stick.usb.hid=HID_ONLY
electroniccats_USB_Stick.usb.hid.build.usbcom=HID_ONLY
electroniccats_USB_Stick.usb.hid.build.pid=0xBAB2
electroniccats_USB_Stick.usb.nocdc=WITHOUT_CDC
electroniccats_USB_Stick.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_USB_Stick.usb.nocdc.build.pid=0xBAB2
electroniccats_USB_Stick.usb.none=USB_DISABLED
electroniccats_USB_Stick.usb.none.build.usbcom=USB_DISABLED
electroniccats_USB_Stick.usb.none.build.pid=0xBAB2

