ElectronicCats/Arduino_Boards_Index/electroniccats/samd_advanced/boards.txt
electroniccats_bast.name=BastWAN
electroniccats_bast.vid.0=0x0ACE
electroniccats_bast.pid.0=0x4260
electroniccats_bast.vid.1=0x0ACE
electroniccats_bast.pid.1=0x4260
electroniccats_bast.vid.2=0x0ACE
electroniccats_bast.pid.2=0x4260
electroniccats_bast.vid.3=0x0ACE
electroniccats_bast.pid.3=0x4260
electroniccats_bast.vid.4=0x0ACE
electroniccats_bast.pid.4=0x4260
electroniccats_bast.vid.5=0x0ACE
electroniccats_bast.pid.5=0x4260
electroniccats_bast.upload.maximum_size=253952
electroniccats_bast.build.mcu=cortex-m0plus
electroniccats_bast.build.mathlib=arm_cortexM0l_math
electroniccats_bast.build.f_cpu=48000000L
electroniccats_bast.build.usb_product="BastWAN"
electroniccats_bast.build.extra_flags=-D__SAMR34J18B__ {build.usb_flags} -DARM_MATH_CM0PLUS
electroniccats_bast.build.usb_manufacturer="Electronic Cats"
electroniccats_bast.build.board=SAMD_ZERO
electroniccats_bast.build.core=arduino
electroniccats_bast.build.variant=bastwan
electroniccats_bast.build.variant_system_lib=
electroniccats_bast.build.vid=0x0ACE
electroniccats_bast.upload.protocol=sam-ba
electroniccats_bast.bootloader.tool=arduino:openocd
electroniccats_bast.build.ldscript=flash_256KB.ld
electroniccats_bast.build.openocdscript=openocd_scripts/SAML21J18B.cfg
electroniccats_bast.bootloader.file=bastwan/bootloader-bast-wan-v3.4.0.bin
electroniccats_bast.menu.float.default=Print & String use auto-promoted doubles only
electroniccats_bast.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
electroniccats_bast.menu.float.print=Print uses separate singles and doubles
electroniccats_bast.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
electroniccats_bast.menu.float.string=String uses separate singles and doubles
electroniccats_bast.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
electroniccats_bast.menu.float.both=Print & String use separate singles and doubles
electroniccats_bast.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
electroniccats_bast.menu.config.disabled=config.h disabled
electroniccats_bast.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
electroniccats_bast.menu.config.enabled=config.h enabled (mostly code size reductions)
electroniccats_bast.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
electroniccats_bast.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
electroniccats_bast.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
electroniccats_bast.menu.clock.internal=INTERNAL_OSCILLATOR
electroniccats_bast.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
electroniccats_bast.menu.clock.crystal_32k=32KHZ_CRYSTAL
electroniccats_bast.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
electroniccats_bast.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
electroniccats_bast.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
electroniccats_bast.menu.timer.timer_732Hz=732.4Hz (16-bit)
electroniccats_bast.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
electroniccats_bast.menu.timer.timer_366Hz=366.2Hz (16-bit)
electroniccats_bast.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
electroniccats_bast.menu.timer.timer_244Hz=244.1Hz (16-bit)
electroniccats_bast.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
electroniccats_bast.menu.timer.timer_183Hz=183.1Hz (16-bit)
electroniccats_bast.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
electroniccats_bast.menu.timer.timer_146Hz=146.5Hz (16-bit)
electroniccats_bast.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
electroniccats_bast.menu.timer.timer_122Hz=122.1Hz (16-bit)
electroniccats_bast.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
electroniccats_bast.menu.timer.timer_105Hz=104.6Hz (16-bit)
electroniccats_bast.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
electroniccats_bast.menu.timer.timer_81Hz=81.38Hz (16-bit)
electroniccats_bast.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
electroniccats_bast.menu.timer.timer_61Hz=61.04Hz (16-bit)
electroniccats_bast.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
electroniccats_bast.menu.timer.timer_31Hz=30.52Hz (16-bit)
electroniccats_bast.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
electroniccats_bast.menu.timer.timer_187500Hz=187500Hz (8-bit)
electroniccats_bast.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
electroniccats_bast.menu.timer.timer_93750Hz=93750Hz (8-bit)
electroniccats_bast.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
electroniccats_bast.menu.timer.timer_62500Hz=62500Hz (8-bit)
electroniccats_bast.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
electroniccats_bast.menu.timer.timer_37500Hz=37500Hz (8-bit)
electroniccats_bast.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
electroniccats_bast.menu.timer.timer_20833Hz=20833Hz (8-bit)
electroniccats_bast.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
electroniccats_bast.menu.timer.timer_12500Hz=12500Hz (8-bit)
electroniccats_bast.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
electroniccats_bast.menu.timer.timer_7500Hz=7500Hz (8-bit)
electroniccats_bast.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
electroniccats_bast.menu.timer.timer_4166Hz=4166Hz (8-bit)
electroniccats_bast.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
electroniccats_bast.menu.timer.timer_2930Hz=2930Hz (8-bit)
electroniccats_bast.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
electroniccats_bast.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
electroniccats_bast.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
electroniccats_bast.menu.bootloader.8kb=8KB_BOOTLOADER
electroniccats_bast.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
electroniccats_bast.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
electroniccats_bast.menu.bootloader.8kb.upload.tool=bossac
electroniccats_bast.menu.bootloader.8kb.upload.use_1200bps_touch=true
electroniccats_bast.menu.bootloader.8kb.upload.wait_for_upload_port=true
electroniccats_bast.menu.bootloader.8kb.upload.native_usb=true
electroniccats_bast.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
electroniccats_bast.menu.serial.one_uart.build.serialcom_uart=ONE_UART
electroniccats_bast.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
electroniccats_bast.menu.serial.one_uart.build.serialcom_spi=NO_SPI
electroniccats_bast.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
electroniccats_bast.menu.serial.two_uart.build.serialcom_uart=TWO_UART
electroniccats_bast.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
electroniccats_bast.menu.serial.two_uart.build.serialcom_spi=NO_SPI
electroniccats_bast.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
electroniccats_bast.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
electroniccats_bast.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
electroniccats_bast.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
electroniccats_bast.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
electroniccats_bast.menu.serial.no_uart.build.serialcom_uart=NO_UART
electroniccats_bast.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
electroniccats_bast.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
electroniccats_bast.menu.usb.cdc=CDC_ONLY
electroniccats_bast.menu.usb.cdc.build.usbcom=CDC_ONLY
electroniccats_bast.menu.usb.cdc.build.pid=0x4260
electroniccats_bast.menu.usb.cdc_hid=CDC_HID
electroniccats_bast.menu.usb.cdc_hid.build.usbcom=CDC_HID
electroniccats_bast.menu.usb.cdc_hid.build.pid=0x4260
electroniccats_bast.menu.usb.withcdc=WITH_CDC
electroniccats_bast.menu.usb.withcdc.build.usbcom=WITH_CDC
electroniccats_bast.menu.usb.withcdc.build.pid=0x4260
electroniccats_bast.menu.usb.hid=HID_ONLY
electroniccats_bast.menu.usb.hid.build.usbcom=HID_ONLY
electroniccats_bast.menu.usb.hid.build.pid=0x4260
electroniccats_bast.menu.usb.nocdc=WITHOUT_CDC
electroniccats_bast.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
electroniccats_bast.menu.usb.nocdc.build.pid=0x4260
electroniccats_bast.menu.usb.none=USB_DISABLED
electroniccats_bast.menu.usb.none.build.usbcom=USB_DISABLED
electroniccats_bast.menu.usb.none.build.pid=0x4260

# Meow Meow Mini based on D11D14A (SOIC-20)
meowmeow_mini.name= Meow Meow Mini
meowmeow_mini.vid.0=0x1209
meowmeow_mini.pid.0=0xBAB5
meowmeow_mini.vid.1=0x1209
meowmeow_mini.pid.1=0xBAB5
meowmeow_mini.vid.2=0x1209
meowmeow_mini.pid.2=0xBAB5
meowmeow_mini.vid.3=0x1209
meowmeow_mini.pid.3=0xBAB5
meowmeow_mini.vid.4=0x1209
meowmeow_mini.pid.4=0xBAB5
meowmeow_mini.vid.5=0x1209
meowmeow_mini.pid.5=0xBAB5
meowmeow_mini.build.mcu=cortex-m0plus
meowmeow_mini.build.mathlib=arm_cortexM0l_math
meowmeow_mini.build.f_cpu=48000000L
meowmeow_mini.build.usb_product="Meow Meow Mini"
meowmeow_mini.build.usb_manufacturer="Electronic Cats"
meowmeow_mini.build.board=SAMD_ZERO
meowmeow_mini.build.core=arduino
meowmeow_mini.build.variant=meowmeow_mini
meowmeow_mini.build.variant_system_lib=
meowmeow_mini.build.vid=0x1209
meowmeow_mini.upload.protocol=sam-ba
meowmeow_mini.bootloader.tool=arduino:openocd
meowmeow_mini.menu.float.default=Print & String use auto-promoted doubles only
meowmeow_mini.menu.float.default.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
meowmeow_mini.menu.float.print=Print uses separate singles and doubles
meowmeow_mini.menu.float.print.build.floatconfig=FLOAT_PRINT_SINGLES_DOUBLES
meowmeow_mini.menu.float.string=String uses separate singles and doubles
meowmeow_mini.menu.float.string.build.floatconfig=FLOAT_STRING_SINGLES_DOUBLES
meowmeow_mini.menu.float.both=Print & String use separate singles and doubles
meowmeow_mini.menu.float.both.build.floatconfig=FLOAT_BOTH_SINGLES_DOUBLES
meowmeow_mini.menu.config.disabled=config.h disabled
meowmeow_mini.menu.config.disabled.build.buildconfig=CONFIG_H_DISABLED
meowmeow_mini.menu.config.enabled=config.h enabled (mostly code size reductions)
meowmeow_mini.menu.config.enabled.build.buildconfig=CONFIG_H_ENABLED
meowmeow_mini.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
meowmeow_mini.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
meowmeow_mini.menu.clock.internal=INTERNAL_OSCILLATOR
meowmeow_mini.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
meowmeow_mini.menu.clock.crystal_32k=32KHZ_CRYSTAL
meowmeow_mini.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
meowmeow_mini.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
meowmeow_mini.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
meowmeow_mini.menu.timer.timer_732Hz=732.4Hz (16-bit)
meowmeow_mini.menu.timer.timer_732Hz.build.timerconfig=TIMER_732Hz
meowmeow_mini.menu.timer.timer_366Hz=366.2Hz (16-bit)
meowmeow_mini.menu.timer.timer_366Hz.build.timerconfig=TIMER_366Hz
meowmeow_mini.menu.timer.timer_244Hz=244.1Hz (16-bit)
meowmeow_mini.menu.timer.timer_244Hz.build.timerconfig=TIMER_244Hz
meowmeow_mini.menu.timer.timer_183Hz=183.1Hz (16-bit)
meowmeow_mini.menu.timer.timer_183Hz.build.timerconfig=TIMER_183Hz
meowmeow_mini.menu.timer.timer_146Hz=146.5Hz (16-bit)
meowmeow_mini.menu.timer.timer_146Hz.build.timerconfig=TIMER_146Hz
meowmeow_mini.menu.timer.timer_122Hz=122.1Hz (16-bit)
meowmeow_mini.menu.timer.timer_122Hz.build.timerconfig=TIMER_122Hz
meowmeow_mini.menu.timer.timer_105Hz=104.6Hz (16-bit)
meowmeow_mini.menu.timer.timer_105Hz.build.timerconfig=TIMER_105Hz
meowmeow_mini.menu.timer.timer_81Hz=81.38Hz (16-bit)
meowmeow_mini.menu.timer.timer_81Hz.build.timerconfig=TIMER_81Hz
meowmeow_mini.menu.timer.timer_61Hz=61.04Hz (16-bit)
meowmeow_mini.menu.timer.timer_61Hz.build.timerconfig=TIMER_61Hz
meowmeow_mini.menu.timer.timer_31Hz=30.52Hz (16-bit)
meowmeow_mini.menu.timer.timer_31Hz.build.timerconfig=TIMER_31Hz
meowmeow_mini.menu.timer.timer_187500Hz=187500Hz (8-bit)
meowmeow_mini.menu.timer.timer_187500Hz.build.timerconfig=TIMER_187500Hz
meowmeow_mini.menu.timer.timer_93750Hz=93750Hz (8-bit)
meowmeow_mini.menu.timer.timer_93750Hz.build.timerconfig=TIMER_93750Hz
meowmeow_mini.menu.timer.timer_62500Hz=62500Hz (8-bit)
meowmeow_mini.menu.timer.timer_62500Hz.build.timerconfig=TIMER_62500Hz
meowmeow_mini.menu.timer.timer_37500Hz=37500Hz (8-bit)
meowmeow_mini.menu.timer.timer_37500Hz.build.timerconfig=TIMER_37500Hz
meowmeow_mini.menu.timer.timer_20833Hz=20833Hz (8-bit)
meowmeow_mini.menu.timer.timer_20833Hz.build.timerconfig=TIMER_20833Hz
meowmeow_mini.menu.timer.timer_12500Hz=12500Hz (8-bit)
meowmeow_mini.menu.timer.timer_12500Hz.build.timerconfig=TIMER_12500Hz
meowmeow_mini.menu.timer.timer_7500Hz=7500Hz (8-bit)
meowmeow_mini.menu.timer.timer_7500Hz.build.timerconfig=TIMER_7500Hz
meowmeow_mini.menu.timer.timer_4166Hz=4166Hz (8-bit)
meowmeow_mini.menu.timer.timer_4166Hz.build.timerconfig=TIMER_4166Hz
meowmeow_mini.menu.timer.timer_2930Hz=2930Hz (8-bit)
meowmeow_mini.menu.timer.timer_2930Hz.build.timerconfig=TIMER_2930Hz
meowmeow_mini.menu.timer.timer_1465Hz=1465Hz (8-bit, 16-bit for D51)
meowmeow_mini.menu.timer.timer_1465Hz.build.timerconfig=TIMER_1465Hz
meowmeow_mini.build.extra_flags=-D__SAMD11D14AS__ {build.usb_flags} -DARM_MATH_CM0PLUS
meowmeow_mini.build.ldscript=flash_16KB.ld
meowmeow_mini.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
meowmeow_mini.bootloader.file=zero/binaries/sam_ba_meowmeow_mini_SAMD11D14A.bin
meowmeow_mini.menu.bootloader.4kb=4KB_BOOTLOADER
meowmeow_mini.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
meowmeow_mini.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
meowmeow_mini.menu.bootloader.4kb.upload.tool=bossac
meowmeow_mini.menu.bootloader.4kb.upload.use_1200bps_touch=true
meowmeow_mini.menu.bootloader.4kb.upload.wait_for_upload_port=true
meowmeow_mini.menu.bootloader.4kb.upload.native_usb=true
meowmeow_mini.menu.bootloader.4kb.upload.maximum_size=12288
meowmeow_mini.menu.bootloader.0kb=NO_BOOTLOADER
meowmeow_mini.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
meowmeow_mini.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
meowmeow_mini.menu.bootloader.0kb.upload.tool=arduino:openocd
meowmeow_mini.menu.bootloader.0kb.upload.use_1200bps_touch=false
meowmeow_mini.menu.bootloader.0kb.upload.wait_for_upload_port=false
meowmeow_mini.menu.bootloader.0kb.upload.native_usb=false
meowmeow_mini.menu.bootloader.0kb.upload.maximum_size=16384
meowmeow_mini.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
meowmeow_mini.menu.serial.one_uart.build.serialcom_uart=ONE_UART
meowmeow_mini.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
meowmeow_mini.menu.serial.one_uart.build.serialcom_spi=NO_SPI
meowmeow_mini.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
meowmeow_mini.menu.serial.two_uart.build.serialcom_uart=TWO_UART
meowmeow_mini.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
meowmeow_mini.menu.serial.two_uart.build.serialcom_spi=NO_SPI
meowmeow_mini.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
meowmeow_mini.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
meowmeow_mini.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
meowmeow_mini.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
meowmeow_mini.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
meowmeow_mini.menu.serial.no_uart.build.serialcom_uart=NO_UART
meowmeow_mini.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
meowmeow_mini.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
meowmeow_mini.menu.usb.cdc=CDC_ONLY
meowmeow_mini.menu.usb.cdc.build.usbcom=CDC_ONLY
meowmeow_mini.menu.usb.cdc.build.pid=0xBAB5
meowmeow_mini.menu.usb.cdc_hid=CDC_HID
meowmeow_mini.menu.usb.cdc_hid.build.usbcom=CDC_HID
meowmeow_mini.menu.usb.cdc_hid.build.pid=0xBAB5
meowmeow_mini.menu.usb.withcdc=WITH_CDC
meowmeow_mini.menu.usb.withcdc.build.usbcom=WITH_CDC
meowmeow_mini.menu.usb.withcdc.build.pid=0xBAB5
meowmeow_mini.menu.usb.hid=HID_ONLY
meowmeow_mini.menu.usb.hid.build.usbcom=HID_ONLY
meowmeow_mini.menu.usb.hid.build.pid=0xBAB5
meowmeow_mini.menu.usb.nocdc=WITHOUT_CDC
meowmeow_mini.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
meowmeow_mini.menu.usb.nocdc.build.pid=0xBAB5
meowmeow_mini.menu.usb.none=USB_DISABLED
meowmeow_mini.menu.usb.none.build.usbcom=USB_DISABLED
meowmeow_mini.menu.usb.none.build.pid=0xBAB5


